KPCR
---

        ntdll!_KPCR
           +0x000 NtTib            : _NT_TIB
           +0x000 Used_ExceptionList : Ptr32 _EXCEPTION_REGISTRATION_RECORD  
           +0x004 Used_StackBase   : Ptr32 Void
           +0x008 Spare2           : Ptr32 Void
           +0x00c TssCopy          : Ptr32 Void
           +0x010 ContextSwitches  : Uint4B
           +0x014 SetMemberCopy    : Uint4B
           +0x018 Used_Self        : Ptr32 Void 
           +0x01c SelfPcr          : Ptr32 _KPCR  //kpcr指向自己
           +0x020 Prcb             : Ptr32 _KPRCB 
           +0x024 Irql             : UChar
           +0x028 IRR              : Uint4B
           +0x02c IrrActive        : Uint4B
           +0x030 IDR              : Uint4B
           +0x034 KdVersionBlock   : Ptr32 Void
           +0x038 IDT              : Ptr32 _KIDTENTRY
           +0x03c GDT              : Ptr32 _KGDTENTRY
           +0x040 TSS              : Ptr32 _KTSS
           +0x044 MajorVersion     : Uint2B
           +0x046 MinorVersion     : Uint2B
           +0x048 SetMember        : Uint4B
           +0x04c StallScaleFactor : Uint4B
           +0x050 SpareUnused      : UChar
           +0x051 Number           : UChar //CPU核心编号
           +0x052 Spare0           : UChar 
           +0x053 SecondLevelCacheAssociativity : UChar
           +0x054 VdmAlert         : Uint4B
           +0x058 KernelReserved   : [14] Uint4B
           +0x090 SecondLevelCacheSize : Uint4B
           +0x094 HalReserved      : [16] Uint4B
           +0x0d4 InterruptMode    : Uint4B
           +0x0d8 Spare1           : UChar
           +0x0dc KernelReserved2  : [17] Uint4B
           +0x120 PrcbData         : _KPRCB

线程相关:
---
**R3:**

TEB: 

        +0x000 NtTib            : _NT_TIB
        +0x030 ProcessEnvironmentBlock : Ptr32 _PEB
        最常用的两个
        
CONTEXT:保存3环的线程环境

        ntdll!_CONTEXT
           +0x000 ContextFlags     : Uint4B
           +0x004 Dr0              : Uint4B
           +0x008 Dr1              : Uint4B
           +0x00c Dr2              : Uint4B
           +0x010 Dr3              : Uint4B
           +0x014 Dr6              : Uint4B
           +0x018 Dr7              : Uint4B
           +0x01c FloatSave        : _FLOATING_SAVE_AREA
           +0x08c SegGs            : Uint4B
           +0x090 SegFs            : Uint4B
           +0x094 SegEs            : Uint4B
           +0x098 SegDs            : Uint4B
           +0x09c Edi              : Uint4B
           +0x0a0 Esi              : Uint4B
           +0x0a4 Ebx              : Uint4B
           +0x0a8 Edx              : Uint4B
           +0x0ac Ecx              : Uint4B
           +0x0b0 Eax              : Uint4B
           +0x0b4 Ebp              : Uint4B
           +0x0b8 Eip              : Uint4B
           +0x0bc SegCs            : Uint4B
           +0x0c0 EFlags           : Uint4B
           +0x0c4 Esp              : Uint4B
           +0x0c8 SegSs            : Uint4B
           +0x0cc ExtendedRegisters : [512] UChar
            都是一些寄存器

需要CONTEXT保存线程环境的原因：存在线程切换，当前的状态需要保存 
          
          线程切换分为:
          主动切换
          被动切换
            
**R0:**

ETHREAD：

      ntdll!_ETHREAD
         +0x000 Tcb              : _KTHREAD
         +0x200 CreateTime       : _LARGE_INTEGER
         +0x208 ExitTime         : _LARGE_INTEGER
         +0x208 KeyedWaitChain   : _LIST_ENTRY
         +0x210 ExitStatus       : Int4B
         +0x214 PostBlockList    : _LIST_ENTRY
         +0x214 ForwardLinkShadow : Ptr32 Void
         +0x218 StartAddress     : Ptr32 Void
         +0x21c TerminationPort  : Ptr32 _TERMINATION_PORT
         +0x21c ReaperLink       : Ptr32 _ETHREAD
         +0x21c KeyedWaitValue   : Ptr32 Void
         +0x220 ActiveTimerListLock : Uint4B
         +0x224 ActiveTimerListHead : _LIST_ENTRY
         +0x22c Cid              : _CLIENT_ID
         +0x234 KeyedWaitSemaphore : _KSEMAPHORE
         +0x234 AlpcWaitSemaphore : _KSEMAPHORE
         +0x248 ClientSecurity   : _PS_CLIENT_SECURITY_CONTEXT
         +0x24c IrpList          : _LIST_ENTRY
         +0x254 TopLevelIrp      : Uint4B
         +0x258 DeviceToVerify   : Ptr32 _DEVICE_OBJECT
         +0x25c CpuQuotaApc      : Ptr32 _PSP_CPU_QUOTA_APC
         +0x260 Win32StartAddress : Ptr32 Void
         +0x264 LegacyPowerObject : Ptr32 Void
         +0x268 ThreadListEntry  : _LIST_ENTRY
         +0x270 RundownProtect   : _EX_RUNDOWN_REF
         +0x274 ThreadLock       : _EX_PUSH_LOCK
         +0x278 ReadClusterSize  : Uint4B
         +0x27c MmLockOrdering   : Int4B
         +0x280 CrossThreadFlags : Uint4B
         +0x280 Terminated       : Pos 0, 1 Bit
         +0x280 ThreadInserted   : Pos 1, 1 Bit
         +0x280 HideFromDebugger : Pos 2, 1 Bit
         +0x280 ActiveImpersonationInfo : Pos 3, 1 Bit
         +0x280 Reserved         : Pos 4, 1 Bit
         +0x280 HardErrorsAreDisabled : Pos 5, 1 Bit
         +0x280 BreakOnTermination : Pos 6, 1 Bit
         +0x280 SkipCreationMsg  : Pos 7, 1 Bit
         +0x280 SkipTerminationMsg : Pos 8, 1 Bit
         +0x280 CopyTokenOnOpen  : Pos 9, 1 Bit
         +0x280 ThreadIoPriority : Pos 10, 3 Bits
         +0x280 ThreadPagePriority : Pos 13, 3 Bits
         +0x280 RundownFail      : Pos 16, 1 Bit
         +0x280 NeedsWorkingSetAging : Pos 17, 1 Bit
         +0x284 SameThreadPassiveFlags : Uint4B
         +0x284 ActiveExWorker   : Pos 0, 1 Bit
         +0x284 ExWorkerCanWaitUser : Pos 1, 1 Bit
         +0x284 MemoryMaker      : Pos 2, 1 Bit
         +0x284 ClonedThread     : Pos 3, 1 Bit
         +0x284 KeyedEventInUse  : Pos 4, 1 Bit
         +0x284 RateApcState     : Pos 5, 2 Bits
         +0x284 SelfTerminate    : Pos 7, 1 Bit
         +0x288 SameThreadApcFlags : Uint4B
         +0x288 Spare            : Pos 0, 1 Bit
         +0x288 StartAddressInvalid : Pos 1, 1 Bit
         +0x288 EtwPageFaultCalloutActive : Pos 2, 1 Bit
         +0x288 OwnsProcessWorkingSetExclusive : Pos 3, 1 Bit
         +0x288 OwnsProcessWorkingSetShared : Pos 4, 1 Bit
         +0x288 OwnsSystemCacheWorkingSetExclusive : Pos 5, 1 Bit
         +0x288 OwnsSystemCacheWorkingSetShared : Pos 6, 1 Bit
         +0x288 OwnsSessionWorkingSetExclusive : Pos 7, 1 Bit
         +0x289 OwnsSessionWorkingSetShared : Pos 0, 1 Bit
         +0x289 OwnsProcessAddressSpaceExclusive : Pos 1, 1 Bit
         +0x289 OwnsProcessAddressSpaceShared : Pos 2, 1 Bit
         +0x289 SuppressSymbolLoad : Pos 3, 1 Bit
         +0x289 Prefetching      : Pos 4, 1 Bit
         +0x289 OwnsDynamicMemoryShared : Pos 5, 1 Bit
         +0x289 OwnsChangeControlAreaExclusive : Pos 6, 1 Bit
         +0x289 OwnsChangeControlAreaShared : Pos 7, 1 Bit
         +0x28a OwnsPagedPoolWorkingSetExclusive : Pos 0, 1 Bit
         +0x28a OwnsPagedPoolWorkingSetShared : Pos 1, 1 Bit
         +0x28a OwnsSystemPtesWorkingSetExclusive : Pos 2, 1 Bit
         +0x28a OwnsSystemPtesWorkingSetShared : Pos 3, 1 Bit
         +0x28a TrimTrigger      : Pos 4, 2 Bits
         +0x28a Spare1           : Pos 6, 2 Bits
         +0x28b PriorityRegionActive : UChar
         +0x28c CacheManagerActive : UChar
         +0x28d DisablePageFaultClustering : UChar
         +0x28e ActiveFaultCount : UChar
         +0x28f LockOrderState   : UChar
         +0x290 AlpcMessageId    : Uint4B
         +0x294 AlpcMessage      : Ptr32 Void
         +0x294 AlpcReceiveAttributeSet : Uint4B
         +0x298 AlpcWaitListEntry : _LIST_ENTRY
         +0x2a0 CacheManagerCount : Uint4B
         +0x2a4 IoBoostCount     : Uint4B
         +0x2a8 IrpListLock      : Uint4B
         +0x2ac ReservedForSynchTracking : Ptr32 Void
         +0x2b0 CmCallbackListHead : _SINGLE_LIST_ENTRY

KTHREAD：

         +0x000 Header           : _DISPATCHER_HEADER
         +0x010 CycleTime        : Uint8B
         +0x018 HighCycleTime    : Uint4B
         +0x020 QuantumTarget    : Uint8B
         +0x028 InitialStack     : Ptr32 Void  //栈底指针
         +0x02c StackLimit       : Ptr32 Void  //栈顶指针
         +0x030 KernelStack      : Ptr32 Void  //内核堆栈，保存ESP
         +0x034 ThreadLock       : Uint4B      //线程锁
         +0x038 WaitRegister     : _KWAIT_STATUS_REGISTER
         +0x039 Running          : UChar       //线程状态
         +0x03a Alerted          : [2] UChar   
         +0x03c KernelStackResident : Pos 0, 1 Bit
         +0x03c ReadyTransition  : Pos 1, 1 Bit
         +0x03c ProcessReadyQueue : Pos 2, 1 Bit
         +0x03c WaitNext         : Pos 3, 1 Bit
         +0x03c SystemAffinityActive : Pos 4, 1 Bit
         +0x03c Alertable        : Pos 5, 1 Bit  //是否可以被唤醒
         +0x03c GdiFlushActive   : Pos 6, 1 Bit
         +0x03c UserStackWalkActive : Pos 7, 1 Bit
         +0x03c ApcInterruptRequest : Pos 8, 1 Bit
         +0x03c ForceDeferSchedule : Pos 9, 1 Bit
         +0x03c QuantumEndMigrate : Pos 10, 1 Bit
         +0x03c UmsDirectedSwitchEnable : Pos 11, 1 Bit
         +0x03c TimerActive      : Pos 12, 1 Bit
         +0x03c SystemThread     : Pos 13, 1 Bit //是否为系统线程
         +0x03c Reserved         : Pos 14, 18 Bits
         +0x03c MiscFlags        : Int4B
         +0x040 ApcState         : _KAPC_STATE
         +0x040 ApcStateFill     : [23] UChar
         +0x057 Priority         : Char        //线程优先级
         +0x058 NextProcessor    : Uint4B      //下一个核心，线程不一定跑在一个核心上 
         +0x05c DeferredProcessor : Uint4B
         +0x060 ApcQueueLock     : Uint4B
         +0x064 ContextSwitches  : Uint4B    //线程切换总次数
         +0x068 State            : UChar
         +0x069 NpxState         : Char
         +0x06a WaitIrql         : UChar
         +0x06b WaitMode         : Char      //等待模式 0环或者3环
         +0x06c WaitStatus       : Int4B     //等待状态
         +0x070 WaitBlockList    : Ptr32 _KWAIT_BLOCK
         +0x074 WaitListEntry    : _LIST_ENTRY
         +0x074 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x07c Queue            : Ptr32 _KQUEUE
         +0x080 WaitTime         : Uint4B
         +0x084 KernelApcDisable : Int2B
         +0x086 SpecialApcDisable : Int2B
         +0x084 CombinedApcDisable : Uint4B
         +0x088 Teb              : Ptr32 Void    //保存TEB
         +0x090 Timer            : _KTIMER       
         +0x0b8 AutoAlignment    : Pos 0, 1 Bit
         +0x0b8 DisableBoost     : Pos 1, 1 Bit
         +0x0b8 EtwStackTraceApc1Inserted : Pos 2, 1 Bit
         +0x0b8 EtwStackTraceApc2Inserted : Pos 3, 1 Bit
         +0x0b8 CalloutActive    : Pos 4, 1 Bit
         +0x0b8 ApcQueueable     : Pos 5, 1 Bit
         +0x0b8 EnableStackSwap  : Pos 6, 1 Bit
         +0x0b8 GuiThread        : Pos 7, 1 Bit
         +0x0b8 UmsPerformingSyscall : Pos 8, 1 Bit
         +0x0b8 VdmSafe          : Pos 9, 1 Bit
         +0x0b8 UmsDispatched    : Pos 10, 1 Bit
         +0x0b8 ReservedFlags    : Pos 11, 21 Bits
         +0x0b8 ThreadFlags      : Int4B
         +0x0bc ServiceTable     : Ptr32 Void
         +0x0c0 WaitBlock        : [4] _KWAIT_BLOCK
         +0x120 QueueListEntry   : _LIST_ENTRY
         +0x128 TrapFrame        : Ptr32 _KTRAP_FRAME
         +0x12c FirstArgument    : Ptr32 Void
         +0x130 CallbackStack    : Ptr32 Void
         +0x130 CallbackDepth    : Uint4B
         +0x134 ApcStateIndex    : UChar
         +0x135 BasePriority     : Char   //进程优先级
         +0x136 PriorityDecrement : Char
         +0x136 ForegroundBoost  : Pos 0, 4 Bits
         +0x136 UnusualBoost     : Pos 4, 4 Bits
         +0x137 Preempted        : UChar
         +0x138 AdjustReason     : UChar
         +0x139 AdjustIncrement  : Char  
         +0x13a PreviousMode     : Char
         +0x13b Saturation       : Char
         +0x13c SystemCallNumber : Uint4B
         +0x140 FreezeCount      : Uint4 B 
         +0x144 UserAffinity     : _GROUP_AFFINITY
         +0x150 Process          : Ptr32 _KPROCESS
         +0x154 Affinity         : _GROUP_AFFINITY
         +0x160 IdealProcessor   : Uint4B
         +0x164 UserIdealProcessor : Uint4B
         +0x168 ApcStatePointer  : [2] Ptr32 _KAPC_STATE
         +0x170 SavedApcState    : _KAPC_STATE
         +0x170 SavedApcStateFill : [23] UChar
         +0x187 WaitReason       : UChar
         +0x188 SuspendCount     : Char
         +0x189 Spare1           : Char
         +0x18a OtherPlatformFill : UChar
         +0x18c Win32Thread      : Ptr32 Void
         +0x190 StackBase        : Ptr32 Void
         +0x194 SuspendApc       : _KAPC
         +0x194 SuspendApcFill0  : [1] UChar
         +0x195 ResourceIndex    : UChar
         +0x194 SuspendApcFill1  : [3] UChar
         +0x197 QuantumReset     : UChar
         +0x194 SuspendApcFill2  : [4] UChar
         +0x198 KernelTime       : Uint4B
         +0x194 SuspendApcFill3  : [36] UChar
         +0x1b8 WaitPrcb         : Ptr32 _KPRCB
         +0x194 SuspendApcFill4  : [40] UChar
         +0x1bc LegoData         : Ptr32 Void
         +0x194 SuspendApcFill5  : [47] UChar
         +0x1c3 LargeStack       : UChar
         +0x1c4 UserTime         : Uint4B
         +0x1c8 SuspendSemaphore : _KSEMAPHORE
         +0x1c8 SuspendSemaphorefill : [20] UChar
         +0x1dc SListFaultCount  : Uint4B
         +0x1e0 ThreadListEntry  : _LIST_ENTRY
         +0x1e8 MutantListHead   : _LIST_ENTRY
         +0x1f0 SListFaultAddress : Ptr32 Void
         +0x1f4 ThreadCounters   : Ptr32 _KTHREAD_COUNTERS
         +0x1f8 XStateSave       : Ptr32 _XSTATE_SAVE


KTRAP_FRAME：保存0环的线程环境

    ntdll!_KTRAP_FRAME
       +0x000 DbgEbp           : Uint4B
       +0x004 DbgEip           : Uint4B
       +0x008 DbgArgMark       : Uint4B
       +0x00c DbgArgPointer    : Uint4B
       +0x010 TempSegCs        : Uint2B
       +0x012 Logging          : UChar
       +0x013 Reserved         : UChar
       +0x014 TempEsp          : Uint4B
       +0x018 Dr0              : Uint4B
       +0x01c Dr1              : Uint4B
       +0x020 Dr2              : Uint4B
       +0x024 Dr3              : Uint4B
       +0x028 Dr6              : Uint4B
       +0x02c Dr7              : Uint4B
       +0x030 SegGs            : Uint4B
       +0x034 SegEs            : Uint4B
       +0x038 SegDs            : Uint4B
       +0x03c Edx              : Uint4B
       +0x040 Ecx              : Uint4B
       +0x044 Eax              : Uint4B
       +0x048 PreviousPreviousMode : Uint4B
       +0x04c ExceptionList    : Ptr32 _EXCEPTION_REGISTRATION_RECORD
       +0x050 SegFs            : Uint4B
       +0x054 Edi              : Uint4B
       +0x058 Esi              : Uint4B
       +0x05c Ebx              : Uint4B
       +0x060 Ebp              : Uint4B
       +0x064 ErrCode          : Uint4B
       +0x068 Eip              : Uint4B
       +0x06c SegCs            : Uint4B
       +0x070 EFlags           : Uint4B
       +0x074 HardwareEsp      : Uint4B
       +0x078 HardwareSegSs    : Uint4B
       +0x07c V86Es            : Uint4B
       +0x080 V86Ds            : Uint4B
       +0x084 V86Fs            : Uint4B
       +0x088 V86Gs            : Uint4B
