代码写完编译成可执行程序，执行代码的是线程

进程是一块惰性空间，也就是内存，是结构，结构中有许多字段，每个进程会有1个或者多个线程执行代码

**三环：PEB**

		ntdll!_PEB
		   +0x000 InheritedAddressSpace : UChar
		   +0x001 ReadImageFileExecOptions : UChar
		   +0x002 BeingDebugged    : UChar //是否被调试
		   +0x003 BitField         : UChar
		   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
		   +0x003 IsProtectedProcess : Pos 1, 1 Bit
		   +0x003 IsLegacyProcess  : Pos 2, 1 Bit
		   +0x003 IsImageDynamicallyRelocated : Pos 3, 1 Bit
		   +0x003 SkipPatchingUser32Forwarders : Pos 4, 1 Bit
		   +0x003 SpareBits        : Pos 5, 3 Bits
		   +0x004 Mutant           : Ptr32 Void
		   +0x008 ImageBaseAddress : Ptr32 Void   //常用
		   +0x00c Ldr              : Ptr32 _PEB_LDR_DATA //常用
		   +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS
		   +0x014 SubSystemData    : Ptr32 Void
		   +0x018 ProcessHeap      : Ptr32 Void   //进程堆	
		   +0x01c FastPebLock      : Ptr32 _RTL_CRITICAL_SECTION
		   +0x020 AtlThunkSListPtr : Ptr32 Void
		   +0x024 IFEOKey          : Ptr32 Void
		   +0x028 CrossProcessFlags : Uint4B
		   +0x028 ProcessInJob     : Pos 0, 1 Bit
		   +0x028 ProcessInitializing : Pos 1, 1 Bit
		   +0x028 ProcessUsingVEH  : Pos 2, 1 Bit
		   +0x028 ProcessUsingVCH  : Pos 3, 1 Bit
		   +0x028 ProcessUsingFTH  : Pos 4, 1 Bit
		   +0x028 ReservedBits0    : Pos 5, 27 Bits
		   +0x02c KernelCallbackTable : Ptr32 Void
		   +0x02c UserSharedInfoPtr : Ptr32 Void
		   +0x030 SystemReserved   : [1] Uint4B
		   +0x034 AtlThunkSListPtr32 : Uint4B
		   +0x038 ApiSetMap        : Ptr32 Void
		   +0x03c TlsExpansionCounter : Uint4B
		   +0x040 TlsBitmap        : Ptr32 Void
		   +0x044 TlsBitmapBits    : [2] Uint4B
		   +0x04c ReadOnlySharedMemoryBase : Ptr32 Void
		   +0x050 HotpatchInformation : Ptr32 Void
		   +0x054 ReadOnlyStaticServerData : Ptr32 Ptr32 Void
		   +0x058 AnsiCodePageData : Ptr32 Void
		   +0x05c OemCodePageData  : Ptr32 Void
		   +0x060 UnicodeCaseTableData : Ptr32 Void
		   +0x064 NumberOfProcessors : Uint4B   //CPU个数
		   +0x068 NtGlobalFlag     : Uint4B   	//标志位
		   +0x070 CriticalSectionTimeout : _LARGE_INTEGER
		   +0x078 HeapSegmentReserve : Uint4B
		   +0x07c HeapSegmentCommit : Uint4B
		   +0x080 HeapDeCommitTotalFreeThreshold : Uint4B
		   +0x084 HeapDeCommitFreeBlockThreshold : Uint4B
		   +0x088 NumberOfHeaps    : Uint4B
		   +0x08c MaximumNumberOfHeaps : Uint4B
		   +0x090 ProcessHeaps     : Ptr32 Ptr32 Void
		   +0x094 GdiSharedHandleTable : Ptr32 Void
		   +0x098 ProcessStarterHelper : Ptr32 Void
		   +0x09c GdiDCAttributeList : Uint4B
		   +0x0a0 LoaderLock       : Ptr32 _RTL_CRITICAL_SECTION
		   +0x0a4 OSMajorVersion   : Uint4B
		   +0x0a8 OSMinorVersion   : Uint4B
		   +0x0ac OSBuildNumber    : Uint2B
		   +0x0ae OSCSDVersion     : Uint2B
		   +0x0b0 OSPlatformId     : Uint4B
		   +0x0b4 ImageSubsystem   : Uint4B
		   +0x0b8 ImageSubsystemMajorVersion : Uint4B
		   +0x0bc ImageSubsystemMinorVersion : Uint4B
		   +0x0c0 ActiveProcessAffinityMask : Uint4B
		   +0x0c4 GdiHandleBuffer  : [34] Uint4B
		   +0x14c PostProcessInitRoutine : Ptr32     void 
		   +0x150 TlsExpansionBitmap : Ptr32 Void
		   +0x154 TlsExpansionBitmapBits : [32] Uint4B
		   +0x1d4 SessionId        : Uint4B
		   +0x1d8 AppCompatFlags   : _ULARGE_INTEGER
		   +0x1e0 AppCompatFlagsUser : _ULARGE_INTEGER
		   +0x1e8 pShimData        : Ptr32 Void
		   +0x1ec AppCompatInfo    : Ptr32 Void
		   +0x1f0 CSDVersion       : _UNICODE_STRING
		   +0x1f8 ActivationContextData : Ptr32 _ACTIVATION_CONTEXT_DATA
		   +0x1fc ProcessAssemblyStorageMap : Ptr32 _ASSEMBLY_STORAGE_MAP
		   +0x200 SystemDefaultActivationContextData : Ptr32 _ACTIVATION_CONTEXT_DATA
		   +0x204 SystemAssemblyStorageMap : Ptr32 _ASSEMBLY_STORAGE_MAP
		   +0x208 MinimumStackCommit : Uint4B
		   +0x20c FlsCallback      : Ptr32 _FLS_CALLBACK_INFO
		   +0x210 FlsListHead      : _LIST_ENTRY
		   +0x218 FlsBitmap        : Ptr32 Void
		   +0x21c FlsBitmapBits    : [4] Uint4B
		   +0x22c FlsHighIndex     : Uint4B
		   +0x230 WerRegistrationData : Ptr32 Void
		   +0x234 WerShipAssertPtr : Ptr32 Void
		   +0x238 pContextData     : Ptr32 Void
		   +0x23c pImageHeaderHash : Ptr32 Void
		   +0x240 TracingFlags     : Uint4B
		   +0x240 HeapTracingEnabled : Pos 0, 1 Bit
		   +0x240 CritSecTracingEnabled : Pos 1, 1 Bit
		   +0x240 SpareTracingBits : Pos 2, 30 Bits


**创建进程**

		#include<stdio.h>
		#include<stdlib.h>
		#include<Windows.h>

		#define EXE_PATH L"D:\\CloudMusic\\cloudmusic.exe"

		BOOL CreateProcessR(const wchar_t *exe_path) {
			SECURITY_ATTRIBUTES psa = { 0 };
			SECURITY_ATTRIBUTES tsa = { 0 };
			STARTUPINFO si = { 0 };
			PROCESS_INFORMATION pi;
			return CreateProcess((LPCUWSTR)exe_path, NULL, &psa, &tsa, true, FALSE, NULL, NULL, &si, &pi);
	
		}


		int main(){
			CreateProcessR(EXE_PATH);//平常只会修改到的参数只有路径，所以我们可以封装一下
		} 

**进程退出**

		TerminateProcess(pi.hProcess, 0);

如果我们拿不到句柄的解决方法,以网易云音乐为例

![](https://raw.githubusercontent.com/Whitebird0/tuchuang/main/QQ%E6%88%AA%E5%9B%BE20211008204037.png)

拿到PID，执行代码，但是不是万能的

			HANDLE a = OpenProcess(PROCESS_TERMINATE, false, 59804);
			TerminateProcess(a, 0);

**进程遍历**

			bool ProcessShow() {
				PROCESSENTRY32 pe32 = { 0 };  //存放快照进程信息的结构体
				pe32.dwSize = sizeof(PROCESSENTRY32);//先设置这个结构体的大小
				HANDLE hSnapShot=CreateToolhelp32Snapshot(TH32CS_SNAPPROCESS, 0);//对系统内的所有进程拍快照
				if (hSnapShot==INVALID_HANDLE_VALUE)//判断是否获取成功
				{
					printf("CreateToolhelp32Snapshot Error");//获取失败
					return false;
				}
				BOOL bret=Process32First(hSnapShot, &pe32);//获取第一个进程信息
				do
				{
					printf("Process Name: %ls\n", pe32.szExeFile);//打印进程名称
					printf("Process ID:%d\n", pe32.th32ProcessID);//打印进程ID
				} while (Process32Next(hSnapShot, &pe32));
				CloseHandle(hSnapShot);//关闭快照句柄

			}

![](https://raw.githubusercontent.com/Whitebird0/tuchuang/main/QQ%E6%88%AA%E5%9B%BE20211008215355.png)

**0环：EPROCESS**
